Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_pretrn (InputLayer)       (None, None, 1)      0                                            
__________________________________________________________________________________________________
strided_conv (Conv1D)           (None, None, 128)    512         input_pretrn[0][0]               
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 128)    512         strided_conv[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, None, 128)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
res_conv_block_1_Conv1 (Conv1D) (None, None, 128)    49280       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
res_conv_block_1_BN1 (BatchNorm (None, None, 128)    512         res_conv_block_1_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_1_Act1 (LeakyReL (None, None, 128)    0           res_conv_block_1_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_1_Conv2 (Conv1D) (None, None, 128)    49280       res_conv_block_1_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_1_BN2 (BatchNorm (None, None, 128)    512         res_conv_block_1_Conv2[0][0]     
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 128)    0           leaky_re_lu_1[0][0]              
                                                                 res_conv_block_1_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_1_Act2 (LeakyReL (None, None, 128)    0           add_1[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 128)    0           res_conv_block_1_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_2_Conv1 (Conv1D) (None, None, 128)    49280       max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
res_conv_block_2_BN1 (BatchNorm (None, None, 128)    512         res_conv_block_2_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_2_Act1 (LeakyReL (None, None, 128)    0           res_conv_block_2_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_2_Conv2 (Conv1D) (None, None, 128)    49280       res_conv_block_2_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_2_BN2 (BatchNorm (None, None, 128)    512         res_conv_block_2_Conv2[0][0]     
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 128)    0           max_pooling1d_1[0][0]            
                                                                 res_conv_block_2_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_2_Act2 (LeakyReL (None, None, 128)    0           add_2[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 128)    0           res_conv_block_2_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_3_Conv1 (Conv1D) (None, None, 256)    98560       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
res_conv_block_3_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_3_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_3_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_3_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_3_transform (Con (None, None, 256)    33024       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
res_conv_block_3_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_3_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_3_BN_transform ( (None, None, 256)    1024        res_conv_block_3_transform[0][0] 
__________________________________________________________________________________________________
res_conv_block_3_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_3_Conv2[0][0]     
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 256)    0           res_conv_block_3_BN_transform[0][
                                                                 res_conv_block_3_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_3_Act2 (LeakyReL (None, None, 256)    0           add_3[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 256)    0           res_conv_block_3_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_4_Conv1 (Conv1D) (None, None, 256)    196864      max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
res_conv_block_4_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_4_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_4_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_4_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_4_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_4_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_4_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_4_Conv2[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 256)    0           max_pooling1d_3[0][0]            
                                                                 res_conv_block_4_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_4_Act2 (LeakyReL (None, None, 256)    0           add_4[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, None, 256)    0           res_conv_block_4_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_5_Conv1 (Conv1D) (None, None, 256)    196864      max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
res_conv_block_5_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_5_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_5_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_5_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_5_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_5_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_5_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_5_Conv2[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, 256)    0           max_pooling1d_4[0][0]            
                                                                 res_conv_block_5_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_5_Act2 (LeakyReL (None, None, 256)    0           add_5[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, None, 256)    0           res_conv_block_5_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_6_Conv1 (Conv1D) (None, None, 256)    196864      max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
res_conv_block_6_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_6_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_6_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_6_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_6_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_6_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_6_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_6_Conv2[0][0]     
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, 256)    0           max_pooling1d_5[0][0]            
                                                                 res_conv_block_6_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_6_Act2 (LeakyReL (None, None, 256)    0           add_6[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, None, 256)    0           res_conv_block_6_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_9_Conv1 (Conv1D) (None, None, 256)    196864      max_pooling1d_6[0][0]            
__________________________________________________________________________________________________
res_conv_block_9_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_9_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_9_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_9_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_9_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_9_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_9_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_9_Conv2[0][0]     
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, 256)    0           max_pooling1d_6[0][0]            
                                                                 res_conv_block_9_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_9_Act2 (LeakyReL (None, None, 256)    0           add_7[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, None, 256)    0           res_conv_block_9_Act2[0][0]      
__________________________________________________________________________________________________
last_conv (Conv1D)              (None, None, 256)    65792       max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 256)    1024        last_conv[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, None, 256)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 256)    0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
global_average_pooling1d_1 (Glo (None, 256)          0           dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          32896       global_average_pooling1d_1[0][0] 
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128)          512         dense_1[0][0]                    
__________________________________________________________________________________________________
code_pretrn (LeakyReLU)         (None, 128)          0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 94)           0                                            
__________________________________________________________________________________________________
s_bs_loss (spk_basis_loss)      (None, 1)            12032       code_pretrn[0][0]                
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
c_loss (CenterLossLayer)        (None, 1)            12032       code_pretrn[0][0]                
                                                                 input_1[0][0]                    
==================================================================================================
Total params: 2,239,104
Trainable params: 2,219,392
Non-trainable params: 19,712
__________________________________________________________________________________________________
