Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_RawNet (InputLayer)       (None, None, 1)      0                                            
__________________________________________________________________________________________________
strided_conv (Conv1D)           (None, None, 128)    512         input_RawNet[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 128)    512         strided_conv[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, None, 128)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
res_conv_block_1_Conv1 (Conv1D) (None, None, 128)    49280       leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
res_conv_block_1_BN1 (BatchNorm (None, None, 128)    512         res_conv_block_1_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_1_Act1 (LeakyReL (None, None, 128)    0           res_conv_block_1_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_1_Conv2 (Conv1D) (None, None, 128)    49280       res_conv_block_1_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_1_BN2 (BatchNorm (None, None, 128)    512         res_conv_block_1_Conv2[0][0]     
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, 128)    0           leaky_re_lu_3[0][0]              
                                                                 res_conv_block_1_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_1_Act2 (LeakyReL (None, None, 128)    0           add_8[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, None, 128)    0           res_conv_block_1_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_2_Conv1 (Conv1D) (None, None, 128)    49280       max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
res_conv_block_2_BN1 (BatchNorm (None, None, 128)    512         res_conv_block_2_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_2_Act1 (LeakyReL (None, None, 128)    0           res_conv_block_2_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_2_Conv2 (Conv1D) (None, None, 128)    49280       res_conv_block_2_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_2_BN2 (BatchNorm (None, None, 128)    512         res_conv_block_2_Conv2[0][0]     
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, 128)    0           max_pooling1d_8[0][0]            
                                                                 res_conv_block_2_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_2_Act2 (LeakyReL (None, None, 128)    0           add_9[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, None, 128)    0           res_conv_block_2_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_3_Conv1 (Conv1D) (None, None, 256)    98560       max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
res_conv_block_3_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_3_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_3_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_3_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_3_transform (Con (None, None, 256)    33024       max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
res_conv_block_3_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_3_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_3_BN_transform ( (None, None, 256)    1024        res_conv_block_3_transform[0][0] 
__________________________________________________________________________________________________
res_conv_block_3_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_3_Conv2[0][0]     
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, 256)    0           res_conv_block_3_BN_transform[0][
                                                                 res_conv_block_3_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_3_Act2 (LeakyReL (None, None, 256)    0           add_10[0][0]                     
__________________________________________________________________________________________________
max_pooling1d_10 (MaxPooling1D) (None, None, 256)    0           res_conv_block_3_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_4_Conv1 (Conv1D) (None, None, 256)    196864      max_pooling1d_10[0][0]           
__________________________________________________________________________________________________
res_conv_block_4_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_4_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_4_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_4_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_4_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_4_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_4_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_4_Conv2[0][0]     
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, 256)    0           max_pooling1d_10[0][0]           
                                                                 res_conv_block_4_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_4_Act2 (LeakyReL (None, None, 256)    0           add_11[0][0]                     
__________________________________________________________________________________________________
max_pooling1d_11 (MaxPooling1D) (None, None, 256)    0           res_conv_block_4_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_5_Conv1 (Conv1D) (None, None, 256)    196864      max_pooling1d_11[0][0]           
__________________________________________________________________________________________________
res_conv_block_5_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_5_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_5_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_5_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_5_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_5_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_5_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_5_Conv2[0][0]     
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, 256)    0           max_pooling1d_11[0][0]           
                                                                 res_conv_block_5_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_5_Act2 (LeakyReL (None, None, 256)    0           add_12[0][0]                     
__________________________________________________________________________________________________
max_pooling1d_12 (MaxPooling1D) (None, None, 256)    0           res_conv_block_5_Act2[0][0]      
__________________________________________________________________________________________________
res_conv_block_6_Conv1 (Conv1D) (None, None, 256)    196864      max_pooling1d_12[0][0]           
__________________________________________________________________________________________________
res_conv_block_6_BN1 (BatchNorm (None, None, 256)    1024        res_conv_block_6_Conv1[0][0]     
__________________________________________________________________________________________________
res_conv_block_6_Act1 (LeakyReL (None, None, 256)    0           res_conv_block_6_BN1[0][0]       
__________________________________________________________________________________________________
res_conv_block_6_Conv2 (Conv1D) (None, None, 256)    196864      res_conv_block_6_Act1[0][0]      
__________________________________________________________________________________________________
res_conv_block_6_BN2 (BatchNorm (None, None, 256)    1024        res_conv_block_6_Conv2[0][0]     
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, 256)    0           max_pooling1d_12[0][0]           
                                                                 res_conv_block_6_BN2[0][0]       
__________________________________________________________________________________________________
res_conv_block_6_Act2 (LeakyReL (None, None, 256)    0           add_13[0][0]                     
__________________________________________________________________________________________________
max_pooling1d_13 (MaxPooling1D) (None, None, 256)    0           res_conv_block_6_Act2[0][0]      
__________________________________________________________________________________________________
gru_0 (GRU)                     (None, 1024)         3935232     max_pooling1d_13[0][0]           
__________________________________________________________________________________________________
gru_dense_0 (Dense)             (None, 128)          131200      gru_0[0][0]                      
__________________________________________________________________________________________________
gru_BN_0 (BatchNormalization)   (None, 128)          512         gru_dense_0[0][0]                
__________________________________________________________________________________________________
code_RawNet (LeakyReLU)         (None, 128)          0           gru_BN_0[0][0]                   
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 94)           0                                            
__________________________________________________________________________________________________
gru_s_bs_loss (spk_basis_loss)  (None, 1)            12032       code_RawNet[0][0]                
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
gru_c_loss (CenterLossLayer)    (None, 1)            12032       code_RawNet[0][0]                
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 5,810,048
Trainable params: 5,791,872
Non-trainable params: 18,176
__________________________________________________________________________________________________
