Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 128)          0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 128)          0                                            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           input_1[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128)          0           input_2[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 128)          0           dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
subtract_1 (Subtract)           (None, 128)          0           dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 128)          0           dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 384)          0           add_1[0][0]                      
                                                                 subtract_1[0][0]                 
                                                                 multiply_1[0][0]                 
__________________________________________________________________________________________________
e2e_dense_0 (Dense)             (None, 1024)         394240      concatenate_1[0][0]              
__________________________________________________________________________________________________
e2e_Dropout_0 (Dropout)         (None, 1024)         0           e2e_dense_0[0][0]                
__________________________________________________________________________________________________
e2e_LRelu_0 (LeakyReLU)         (None, 1024)         0           e2e_Dropout_0[0][0]              
__________________________________________________________________________________________________
e2e_dense_1 (Dense)             (None, 1024)         1049600     e2e_LRelu_0[0][0]                
__________________________________________________________________________________________________
e2e_Dropout_1 (Dropout)         (None, 1024)         0           e2e_dense_1[0][0]                
__________________________________________________________________________________________________
e2e_LRelu_1 (LeakyReLU)         (None, 1024)         0           e2e_Dropout_1[0][0]              
__________________________________________________________________________________________________
e2e_dense_2 (Dense)             (None, 1024)         1049600     e2e_LRelu_1[0][0]                
__________________________________________________________________________________________________
e2e_Dropout_2 (Dropout)         (None, 1024)         0           e2e_dense_2[0][0]                
__________________________________________________________________________________________________
e2e_LRelu_2 (LeakyReLU)         (None, 1024)         0           e2e_Dropout_2[0][0]              
__________________________________________________________________________________________________
e2e_dense_3 (Dense)             (None, 1024)         1049600     e2e_LRelu_2[0][0]                
__________________________________________________________________________________________________
e2e_Dropout_3 (Dropout)         (None, 1024)         0           e2e_dense_3[0][0]                
__________________________________________________________________________________________________
e2e_LRelu_3 (LeakyReLU)         (None, 1024)         0           e2e_Dropout_3[0][0]              
__________________________________________________________________________________________________
e2e_out (Dense)                 (None, 2)            2050        e2e_LRelu_3[0][0]                
==================================================================================================
Total params: 3,545,090
Trainable params: 3,545,090
Non-trainable params: 0
__________________________________________________________________________________________________
